-- AchievementConfigConfig.lua

local AchievementConfigConfig = {
    ['活过10天'] = {
      ['成就ID'] = 'ACHIEVE_1759053124495_5493',
      ['名字'] = '活过10天',
      ['排序'] = 1,
      ['描述'] = '活到第10天',
      ['星级'] = 1,
      ['图标'] = 'sandboxId://ui/成就ui/成就图标/保卫行动.png',
      ['解锁条件'] = {
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '成就_固定值_生成天数',
          ['条件类型'] = '大于等于',
          ['比较值'] = 10,
          ['描述'] = '生存天数大于10天',
        },
      },
      ['解锁奖励'] = {
        {
          ['奖励类型'] = '物品',
          ['物品名称'] = '钻石',
          ['物品数量'] = 1,
          ['变量名称'] = '',
          ['数值'] = 0,
          ['描述'] = 1,
        },
      },
    },
}

return AchievementConfigConfig
