-- AnimationConfigConfig.lua

local AnimationConfigConfig = {
    ['站立恐怖鹿'] = {
      ['名字'] = '站立恐怖鹿',
      ['描述'] = '',
      ['角色名称'] = '站立恐怖鹿',
      ['初始状态'] = 'stand',
      ['动画播放配置'] = {
        {
          ['名称'] = '站立待机动画',
          ['动画名称'] = 'stand',
          ['播放模式'] = '循环',
          ['播放时间'] = -1,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0,
        },
        {
          ['名称'] = '站立攻击',
          ['动画名称'] = 'attack1',
          ['播放模式'] = '单次',
          ['播放时间'] = 0,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0.3,
        },
        {
          ['名称'] = '攻击动画',
          ['动画名称'] = 'attack',
          ['播放模式'] = '单次',
          ['播放时间'] = 1,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0.5,
        },
        {
          ['名称'] = '攻击待机',
          ['动画名称'] = 'idle',
          ['播放模式'] = '循环',
          ['播放时间'] = 1,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0,
        },
        {
          ['名称'] = '跑步动画',
          ['动画名称'] = 'run',
          ['播放模式'] = '单次',
          ['播放时间'] = 0.6,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0,
        },
        {
          ['名称'] = '被灯光照射',
          ['动画名称'] = 'shan',
          ['播放模式'] = '单次',
          ['播放时间'] = 0.33,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0,
        },
        {
          ['名称'] = '突脸动画',
          ['动画名称'] = 'tulian',
          ['播放模式'] = '单次',
          ['播放时间'] = 0.53,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0,
        },
        {
          ['名称'] = '行走',
          ['动画名称'] = 'walk',
          ['播放模式'] = '单次',
          ['播放时间'] = 1.33,
          ['播放时机'] = '无',
          ['触发效果时间'] = 0,
        },
      },
    },
}

return AnimationConfigConfig
