-- BuffConfig.lua

local BuffConfig = {
    ['中级伐木'] = {
      ['唯一ID'] = '中级伐木',
      ['名字'] = '中级伐木',
      ['图标'] = '',
      ['特效'] = '',
      ['显示名称'] = '中级伐木',
      ['buff类型'] = '掉落',
      ['堆叠类型'] = '不可堆叠',
      ['buff时长类型'] = '永久',
      ['持续时间'] = -1,
      ['效果列表'] = {
        {
          ['效果名称'] = '木头掉落',
          ['效果描述'] = '',
          ['玩家属性影响'] = {
          },
          ['玩家变量影响'] = {
          },
          ['掉落物品列表'] = {
            {
              ['物品'] = '木头',
              ['数量'] = 1,
              ['概率'] = 0.2,
              ['作用方式'] = '基础百分比相乘',
            },
          },
        },
      },
    },
    ['初级伐木'] = {
      ['唯一ID'] = '初级伐木',
      ['名字'] = '初级伐木',
      ['图标'] = '',
      ['特效'] = '',
      ['显示名称'] = '初级伐木',
      ['buff类型'] = '玩家属性',
      ['堆叠类型'] = '不可堆叠',
      ['buff时长类型'] = '永久',
      ['持续时间'] = -1,
      ['效果列表'] = {
        {
          ['效果名称'] = '初级伐木速率',
          ['效果描述'] = '伐木速率提示百分之20',
          ['玩家属性影响'] = {
            {
              ['变量名称'] = '砍伐速度',
              ['数值'] = 0.2,
              ['作用方式'] = '基础百分比相乘',
            },
          },
          ['玩家变量影响'] = {
          },
          ['掉落物品列表'] = {
          },
        },
      },
    },
    ['高级伐木'] = {
      ['唯一ID'] = '高级伐木',
      ['名字'] = '高级伐木',
      ['图标'] = '',
      ['特效'] = '',
      ['显示名称'] = '高级伐木',
      ['buff类型'] = '掉落',
      ['堆叠类型'] = '不可堆叠',
      ['buff时长类型'] = '永久',
      ['持续时间'] = -1,
      ['效果列表'] = {
        {
          ['效果名称'] = '',
          ['效果描述'] = '',
          ['玩家属性影响'] = {
          },
          ['玩家变量影响'] = {
          },
          ['掉落物品列表'] = {
            {
              ['物品'] = '树木种子',
              ['数量'] = 1,
              ['概率'] = 0.2,
              ['作用方式'] = '基础百分比相乘',
            },
          },
        },
      },
    },
}

return BuffConfig
