-- EquipmentConfig.lua

local EquipmentConfig = {
    ['一级斧头'] = {
      ['名字'] = '一级斧头',
      ['显示名称'] = '初级浮头',
      ['描述'] = '砍树与对敌对生物造成伤害',
      ['资源图标'] = '',
      ['资源模型'] = '',
      ['模型资源缓存位置'] = '',
      ['模型局部位置'] = { 0, 0, 0 },
      ['模型局部欧拉角'] = { 0, 0, 0 },
      ['模型局部规模'] = { 1, 1, 1 },
      ['是否启用模型局部位置'] = false,
      ['是否启用模型局部欧拉角'] = false,
      ['是否启用模型局部规模'] = false,
      ['装备类型'] = '武器',
      ['伤害类型'] = nil,
      ['攻击距离'] = 200,
      ['伤害'] = 20,
      ['攻速'] = 0.5,
      ['最大耐久度'] = 30,
      ['子弹数量'] = 0,
      ['爆伤倍率'] = 1,
      ['爆伤位置'] = '',
      ['属性配置'] = {
        {
          ['属性'] = '攻击速度',
          ['数值'] = 500,
        },
      },
    },
    ['二级斧头'] = {
      ['名字'] = '二级斧头',
      ['显示名称'] = '中级斧头',
      ['描述'] = '',
      ['资源图标'] = '',
      ['资源模型'] = '',
      ['模型资源缓存位置'] = '',
      ['模型局部位置'] = { 0, 0, 0 },
      ['模型局部欧拉角'] = { 0, 0, 0 },
      ['模型局部规模'] = { 1, 1, 1 },
      ['是否启用模型局部位置'] = false,
      ['是否启用模型局部欧拉角'] = false,
      ['是否启用模型局部规模'] = false,
      ['装备类型'] = '防具',
      ['伤害类型'] = nil,
      ['攻击距离'] = 200,
      ['伤害'] = 30,
      ['攻速'] = 0.5,
      ['最大耐久度'] = 0,
      ['子弹数量'] = 0,
      ['爆伤倍率'] = 1,
      ['爆伤位置'] = '',
      ['属性配置'] = {
        {
          ['属性'] = '攻击速度',
          ['数值'] = 500,
        },
      },
    },
}

return EquipmentConfig
