-- ItemTypeConfig.lua

local ItemTypeConfig = {
    ['斧头'] = {
      ['名字'] = '斧头',
      ['显示名称'] = '',
      ['描述'] = '',
      ['图标'] = '',
      ['品级'] = 'N',
      ['额外战力'] = 0,
      ['最大强化等级'] = 0,
      ['装备配置'] = '斧头1级',
      ['颜色'] = {
        ['r'] = 255,
        ['g'] = 255,
        ['b'] = 255,
        ['a'] = 255,
      },
      ['最大耐久度'] = 30,
      ['最大叠加数量'] = 1,
      ['类型'] = '装备',
      ['攻击类型'] = '近战',
      ['可手持'] = true,
      ['是否可装备'] = true,
      ['使用执行指令'] = {
      },
      ['获取执行指令'] = {
      },
    },
    ['钻石'] = {
      ['名字'] = '钻石',
      ['显示名称'] = '钻石',
      ['描述'] = '',
      ['图标'] = '',
      ['品级'] = 'UR',
      ['额外战力'] = 0,
      ['最大强化等级'] = 0,
      ['装备配置'] = nil,
      ['颜色'] = {
        ['r'] = 255,
        ['g'] = 255,
        ['b'] = 255,
        ['a'] = 255,
      },
      ['最大耐久度'] = 0,
      ['最大叠加数量'] = 9999999,
      ['类型'] = '货币',
      ['攻击类型'] = '无',
      ['可手持'] = false,
      ['是否可装备'] = false,
      ['使用执行指令'] = {
      },
      ['获取执行指令'] = {
      },
    },
}

return ItemTypeConfig
