-- MonsterConfigConfig.lua

local MonsterConfigConfig = {
    ['恐怖小鹿'] = {
      ['名字'] = '恐怖小鹿',
      ['显示名'] = '',
      ['描述'] = '',
      ['模型资源'] = 'resId&usev2=1://432745835804086274',
      ['动画资源'] = 'resId&usev2=1://430144391540232200',
      ['模型缓存'] = '怪物模型/站立恐怖鹿',
      ['动画状态机'] = '站立恐怖鹿',
      ['怪物类型'] = 'Boss',
      ['是否显示血条'] = true,
      ['属性配置'] = {
        {
          ['属性'] = '',
          ['数值'] = 500,
          ['作用方式'] = '单独相加',
        },
        {
          ['属性'] = '攻击力',
          ['数值'] = 80,
          ['作用方式'] = '单独相加',
        },
        {
          ['属性'] = '攻击力',
          ['数值'] = 80,
          ['作用方式'] = '单独相加',
        },
        {
          ['属性'] = '移动速度',
          ['数值'] = 1000,
          ['作用方式'] = '单独相加',
        },
      },
      ['行为列表'] = {
        {
          ['行为逻辑'] = '近战攻击',
          ['权重'] = 1,
          ['播放动画名称'] = '站立攻击',
        },
        {
          ['行为逻辑'] = '游荡',
          ['权重'] = 2,
          ['播放动画名称'] = '行走',
        },
      },
      ['技能配置列表'] = {
        '中级伐木技能',
        '初级伐木技能',
      },
      ['死亡掉落列表'] = {
        {
          ['物品'] = '钻石',
          ['数量'] = 1,
          ['概率'] = 0,
          ['作用方式'] = '单独相加',
        },
      },
    },
}

return MonsterConfigConfig
