-- ProfessionConfig.lua

local ProfessionConfig = {
    ['伐木工'] = {
      ['名字'] = '伐木工',
      ['显示名'] = '伐木工',
      ['星级'] = 0,
      ['资源图标'] = 'sandboxId://ui/职业ui/职业头像/1_露营者.pn',
      ['资源模型'] = '',
      ['装备拥有'] = {
        {
          ['物品'] = '中级斧头',
          ['数量'] = 1,
        },
      },
      ['属性配置'] = {
      },
      ['天赋'] = {
        {
          ['天赋名称'] = '初级砍伐',
          ['天赋效果'] = nil,
          ['解锁需求'] = {
          },
          ['天赋描述'] = '砍伐木头的速度速度20%',
          ['下一级天赋'] = nil,
        },
        {
          ['天赋名称'] = '木头提升',
          ['天赋效果'] = nil,
          ['解锁需求'] = {
            '$数据_固定值_伐木工砍伐普通树木数量$ >=50',
            '$数据_固定值_伐木工种植树木数量$ >=10',
          },
          ['天赋描述'] = '砍伐树木有20%的概率额外获得一个',
          ['下一级天赋'] = nil,
        },
        {
          ['天赋名称'] = '树木种子提示',
          ['天赋效果'] = nil,
          ['解锁需求'] = {
            '$数据_固定值_伐木工砍伐高级树木数量$ >=50',
            '$数据_固定值_伐木工种植树木数量$ >=70',
          },
          ['天赋描述'] = '砍伐树木有20%的概率额外获得一个树木种子',
          ['下一级天赋'] = nil,
        },
      },
    },
}

return ProfessionConfig
