-- SceneNodeConfigConfig.lua

local SceneNodeConfigConfig = {
    ['充值节点'] = {
      ['名字'] = '充值节点',
      ['唯一ID'] = 'fa44fc3a-6770-472e-ad52-7ccaf5e85a99',
      ['场景节点路径'] = '',
      ['场景类型'] = 'NPC节点',
      ['所属场景'] = 'MainCity',
      ['区域节点配置'] = {
        ['包围盒节点'] = '',
        ['复活节点'] = '',
        ['传送节点'] = '',
        ['导航节点'] = '',
        ['需求描述节点'] = '',
        ['作用描述节点'] = '',
        ['倒计时显示节点'] = '',
        ['比赛场景'] = '',
      },
      ['关联关卡'] = '',
      ['玩法规则'] = {
        ['游戏时长'] = 0,
        ['准备时长'] = 0,
        ['游戏结束条件'] = {
          '是',
        },
      },
      ['音效资源'] = '',
      ['需求描述'] = '',
      ['作用描述'] = '',
      ['作数值的配置'] = 0,
      ['进入条件列表'] = {
        {
          ['条件公式'] = '',
        },
      },
      ['进入指令'] = '',
      ['离开指令'] = '',
      ['定时指令列表'] = {
        {
          ['指令'] = '',
          ['间隔'] = 0,
        },
      },
    },
}

return SceneNodeConfigConfig
