-- SkillConfigConfig.lua

local SkillConfigConfig = {
    ['中级伐木技能'] = {
      ['技能名称'] = '中级伐木技能',
      ['显示名称'] = '中级伐木技能',
      ['技能最大等级'] = 1,
      ['最大星级'] = 1,
      ['图标'] = '',
      ['品级'] = 'N',
      ['技能类型'] = '主动',
      ['技能升级需求列表'] = {
      },
      ['技能升星需求列表'] = {
      },
      ['buff绑定列表'] = {
      },
      ['作用目标'] = {
      },
      ['释放特效'] = '',
      ['施法距离'] = 0,
      ['指示器半径'] = 0,
      ['技能伤害组成'] = {
        ['基础伤害'] = 0,
        ['等级伤害'] = '',
        ['其它加成公式'] = '',
        ['附加伤害公式'] = {
        },
      },
      ['伤害类型'] = nil,
      ['属性配置'] = {
      },
      ['掉落物品列表'] = {
        {
          ['物品'] = '木头',
          ['数量'] = 1,
          ['概率'] = 0.2,
          ['作用方式'] = '基础百分比相加',
        },
      },
      ['冷却时间公式'] = '',
      ['消耗前置检查'] = {
      },
      ['消耗配置'] = {
      },
    },
    ['初级伐木技能'] = {
      ['技能名称'] = '初级伐木技能',
      ['显示名称'] = '初级伐木',
      ['技能最大等级'] = 1,
      ['最大星级'] = 5,
      ['图标'] = '',
      ['品级'] = 'N',
      ['技能类型'] = '被动',
      ['技能升级需求列表'] = {
        {
          ['等级'] = 0,
          ['需求描述'] = '',
          ['物品需求列表'] = {
            '',
          },
          ['属性条件列表'] = {
            '',
          },
          ['变量条件列表'] = {
          },
        },
      },
      ['技能升星需求列表'] = {
        {
          ['等级'] = 0,
          ['需求描述'] = '',
          ['物品需求列表'] = {
            '',
          },
          ['属性条件列表'] = {
          },
          ['变量条件列表'] = {
          },
        },
      },
      ['buff绑定列表'] = {
        nil,
      },
      ['作用目标'] = {
        '自己',
      },
      ['释放特效'] = '',
      ['施法距离'] = 200,
      ['指示器半径'] = 0,
      ['技能伤害组成'] = {
        ['基础伤害'] = 0,
        ['等级伤害'] = '',
        ['其它加成公式'] = '',
        ['附加伤害公式'] = {
        },
      },
      ['伤害类型'] = nil,
      ['属性配置'] = {
        {
          ['属性'] = '砍伐速度',
          ['数值'] = 0.2,
          ['作用方式'] = '基础百分比相乘',
        },
      },
      ['掉落物品列表'] = {
      },
      ['冷却时间公式'] = '',
      ['消耗前置检查'] = {
      },
      ['消耗配置'] = {
      },
    },
    ['高级伐木技能'] = {
      ['技能名称'] = '高级伐木技能',
      ['显示名称'] = '高级伐木技能',
      ['技能最大等级'] = 1,
      ['最大星级'] = 1,
      ['图标'] = '',
      ['品级'] = 'N',
      ['技能类型'] = '主动',
      ['技能升级需求列表'] = {
      },
      ['技能升星需求列表'] = {
      },
      ['buff绑定列表'] = {
      },
      ['作用目标'] = {
      },
      ['释放特效'] = '',
      ['施法距离'] = 0,
      ['指示器半径'] = 0,
      ['技能伤害组成'] = {
        ['基础伤害'] = 0,
        ['等级伤害'] = '',
        ['其它加成公式'] = '',
        ['附加伤害公式'] = {
        },
      },
      ['伤害类型'] = nil,
      ['属性配置'] = {
      },
      ['掉落物品列表'] = {
        {
          ['物品'] = '树木种子',
          ['数量'] = 1,
          ['概率'] = 0.2,
          ['作用方式'] = '基础百分比相加',
        },
      },
      ['冷却时间公式'] = '',
      ['消耗前置检查'] = {
      },
      ['消耗配置'] = {
      },
    },
}

return SkillConfigConfig
