-- TaskConfigConfig.lua

local TaskConfigConfig = {
    ['击杀野狼'] = {
      ['任务ID'] = 'TASK_1759040632925_1935',
      ['名称'] = '击杀野狼',
      ['描述'] = '击杀10只野狼，10只兔子',
      ['任务类型'] = '战斗',
      ['任务分类'] = '每日',
      ['优先级'] = 1,
      ['接取条件'] = {
      },
      ['完成条件'] = {
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '每日任务_固定值_每日击杀野狼',
          ['条件类型'] = '大于等于',
          ['比较值'] = 10,
          ['描述'] = '击杀10只野狼',
        },
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '每日任务_固定值_每日击杀兔子',
          ['条件类型'] = '大于等于',
          ['比较值'] = 10,
          ['描述'] = '击杀10只兔子',
        },
      },
      ['任务地点'] = { 0, 0, 0 },
      ['NPC地点'] = { 0, 0, 0 },
      ['完成奖励'] = {
        {
          ['奖励类型'] = '物品',
          ['物品名称'] = '钻石',
          ['物品数量'] = 10,
          ['变量名称'] = '',
          ['数值'] = 0,
          ['描述'] = '获得10个钻石',
        },
      },
      ['完成执行相关指令'] = {
      },
      ['任务时限'] = 0,
      ['冷却时间'] = 0,
      ['图标'] = '',
      ['提示文本'] = '',
      ['完成文本'] = '',
    },
    ['初级生存'] = {
      ['任务ID'] = 'TASK_1759040827446_3481',
      ['名称'] = '初级生存',
      ['描述'] = '',
      ['任务类型'] = '生存',
      ['任务分类'] = '每日',
      ['优先级'] = 0,
      ['接取条件'] = {
      },
      ['完成条件'] = {
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '每日任务_固定值_每日最大生存天数',
          ['条件类型'] = '大于等于',
          ['比较值'] = 10,
          ['描述'] = '单局游戏生存天数到达10日',
        },
      },
      ['任务地点'] = { 0, 0, 0 },
      ['NPC地点'] = { 0, 0, 0 },
      ['完成奖励'] = {
        {
          ['奖励类型'] = '物品',
          ['物品名称'] = '钻石',
          ['物品数量'] = 10,
          ['变量名称'] = '',
          ['数值'] = 0,
          ['描述'] = '获得10个钻石',
        },
      },
      ['完成执行相关指令'] = {
      },
      ['任务时限'] = 0,
      ['冷却时间'] = 0,
      ['图标'] = '',
      ['提示文本'] = '',
      ['完成文本'] = '',
    },
    ['木头收集'] = {
      ['任务ID'] = 'TASK_1759024102986_2979',
      ['名称'] = '木头收集',
      ['描述'] = '收集10根木头',
      ['任务类型'] = '收集',
      ['任务分类'] = '每日',
      ['优先级'] = 1,
      ['接取条件'] = {
      },
      ['完成条件'] = {
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '每日任务_固定值_每日收集树木',
          ['条件类型'] = '大于等于',
          ['比较值'] = 10,
          ['描述'] = '收集木头到达10个',
        },
      },
      ['任务地点'] = { 0, 0, 0 },
      ['NPC地点'] = { 0, 0, 0 },
      ['完成奖励'] = {
        {
          ['奖励类型'] = '物品',
          ['物品名称'] = '钻石',
          ['物品数量'] = 10,
          ['变量名称'] = '',
          ['数值'] = 0,
          ['描述'] = 10,
        },
      },
      ['完成执行相关指令'] = {
        'PlayerVariable { "操作类型": "设置", "变量名称": "任务_固定值_每日收集树木", "数值": "0" }',
      },
      ['任务时限'] = 0,
      ['冷却时间'] = 0,
      ['图标'] = '',
      ['提示文本'] = '',
      ['完成文本'] = '',
    },
    ['生产食物'] = {
      ['任务ID'] = 'TASK_1759041074212_3585',
      ['名称'] = '生产食物',
      ['描述'] = '在单局游戏制作3个食物',
      ['任务类型'] = '合作',
      ['任务分类'] = '每日',
      ['优先级'] = 0,
      ['接取条件'] = {
      },
      ['完成条件'] = {
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '每日任务_固定值_每日生产食物',
          ['条件类型'] = '大于等于',
          ['比较值'] = 3,
          ['描述'] = '单局游戏生产食物达到3个',
        },
      },
      ['任务地点'] = { 0, 0, 0 },
      ['NPC地点'] = { 0, 0, 0 },
      ['完成奖励'] = {
        {
          ['奖励类型'] = '物品',
          ['物品名称'] = '钻石',
          ['物品数量'] = 10,
          ['变量名称'] = '',
          ['数值'] = 0,
          ['描述'] = '',
        },
      },
      ['完成执行相关指令'] = {
      },
      ['任务时限'] = 0,
      ['冷却时间'] = 0,
      ['图标'] = '',
      ['提示文本'] = '',
      ['完成文本'] = '',
    },
}

return TaskConfigConfig
