-- TaskConfigConfig.lua

local TaskConfigConfig = {
    ['收集'] = {
      ['任务ID'] = 'TASK_1759024102986_2979',
      ['名称'] = '收集',
      ['描述'] = '收集10根木头',
      ['任务类型'] = '收集',
      ['任务分类'] = '每日',
      ['优先级'] = 1,
      ['接取条件'] = {
        '',
      },
      ['完成条件'] = {
        {
          ['变量类型'] = '玩家变量',
          ['变量名称'] = '任务_固定值_每日收集树木',
          ['条件类型'] = '大于等于',
          ['比较值'] = 10,
        },
      },
      ['任务地点'] = { 0, 0, 0 },
      ['NPC地点'] = { 0, 0, 0 },
      ['完成奖励'] = {
        '',
      },
      ['完成执行相关指令'] = {
        'cmd {"test"}',
      },
      ['任务时限'] = 0,
      ['冷却时间'] = 0,
      ['图标'] = '',
      ['提示文本'] = '',
      ['完成文本'] = '',
    },
}

return TaskConfigConfig
